docs/requests/iti-45-gassmann-eprik.http

### PIXv3 Query ITI-45 for Gassmann based on local ID
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201309UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:177ba6dc-fc2b-460f-a563-af4d3fc83d55</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085902758" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922053322"/>
    <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.196.3.2.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
            <assignedPerson classCode="ASSIGNED">
                <id root="2.16.756.5.30.1.196.3.2.1"/>
            </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
            <queryId extension="1663085902759" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <dataSource>
                    <value root="2.16.756.5.30.1.191.1.0.2.1"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <dataSource>
                    <value root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <patientIdentifier>
                    <value extension="P003" root="2.16.756.5.30.1.999.90"/>
                    <semanticsText>Patient.id</semanticsText>
                </patientIdentifier>
            </parameterList>
        </queryByParameter>
    </controlActProcess>
</PRPA_IN201309UV02></soap:Body></soap:Envelope>


### PIXv3 Query ITI-45 for Gassmann based on AHVN 756.0557.9153.23
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201309UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:177ba6dc-fc2b-460f-a563-af4d3fc83d55</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085902758" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922053322"/>
    <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.196.3.2.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
            <assignedPerson classCode="ASSIGNED">
                <id root="2.16.756.5.30.1.196.3.2.1"/>
            </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
            <queryId extension="1663085902759" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <dataSource>
                    <value root="2.16.756.5.30.1.191.1.0.2.1"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <dataSource>
                    <value root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <patientIdentifier>
                    <value extension="7560557915323" root="2.16.756.5.32"/>
                    <semanticsText>Patient.id</semanticsText>
                </patientIdentifier>
            </parameterList>
          </queryByParameter>
    </controlActProcess>
</PRPA_IN201309UV02></soap:Body></soap:Envelope>

### PIXv3  ITI-45 for Patient with AHVN 7560739410295 no EPR and no MPI-PID
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201309UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:177ba6dc-fc2b-460f-a563-af4d3fc83d55</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085902758" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922053322"/>
    <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.196.3.2.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
            <assignedPerson classCode="ASSIGNED">
                <id root="2.16.756.5.30.1.196.3.2.1"/>
            </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
            <queryId extension="1663085902759" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <dataSource>
                    <value root="2.16.756.5.30.1.191.1.0.2.1"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <dataSource>
                    <value root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <patientIdentifier>
                    <value extension="7560739410295" root="2.16.756.5.32"/>
                    <semanticsText>Patient.id</semanticsText>
                </patientIdentifier>
            </parameterList>
          </queryByParameter>
    </controlActProcess>
</PRPA_IN201309UV02></soap:Body></soap:Envelope>


### PIXv3  ITI-45 for Patient with AHVN 7560520619845 has EPR and no MPI-PID
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201309UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:177ba6dc-fc2b-460f-a563-af4d3fc83d55</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085902758" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922053322"/>
    <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.196.3.2.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
            <assignedPerson classCode="ASSIGNED">
                <id root="2.16.756.5.30.1.196.3.2.1"/>
            </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
            <queryId extension="1663085902759" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <dataSource>
                    <value root="2.16.756.5.30.1.191.1.0.2.1"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <dataSource>
                    <value root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <patientIdentifier>
                    <value extension="7560520619845" root="2.16.756.5.32"/>
                    <semanticsText>Patient.id</semanticsText>
                </patientIdentifier>
            </parameterList>
          </queryByParameter>
    </controlActProcess>
</PRPA_IN201309UV02></soap:Body></soap:Envelope>



### PIXv3  ITI-45 for Patient with AHVN 7560520619845 has EPR and no MPI-PID
POST https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201309UV02</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:177ba6dc-fc2b-460f-a563-af4d3fc83d55</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://test.ahdis.ch/eprik-cara/camel/cara/eprik/UPIProxy/services/PIXPDQV3ManagerService</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
    <id extension="1663085902758" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
    <creationTime value="20220922053322"/>
    <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="AL"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.191.1.0.12.1.101.2"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.756.5.30.1.196.3.2.1"/>
        </device>
    </sender>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <authorOrPerformer typeCode="AUT">
            <assignedPerson classCode="ASSIGNED">
                <id root="2.16.756.5.30.1.196.3.2.1"/>
            </assignedPerson>
        </authorOrPerformer>
        <queryByParameter>
            <queryId extension="1663085902759" root="1.3.6.1.4.1.21367.2017.2.1.104"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <dataSource>
                    <value root="2.16.756.5.30.1.191.1.0.2.1"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <dataSource>
                    <value root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>DataSource.id</semanticsText>
                </dataSource>
                <patientIdentifier>
                    <value extension="7560520619845" root="2.16.756.5.30.1.127.3.10.3"/>
                    <semanticsText>Patient.id</semanticsText>
                </patientIdentifier>
            </parameterList>
          </queryByParameter>
    </controlActProcess>
</PRPA_IN201309UV02></soap:Body></soap:Envelope>